БухЭксп/Reports/СверкаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаБанковскойВыписки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТолькоДниРасхождений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/ЗагруженныеБанковскиеВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗагруженныеБанковскиеВыписки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачальныйОстаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Списание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйОстаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОбОстаткахОтсутствуют</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиЗагрузкиБанковскихВыписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/ИсточникиЗагрузкиБанковскихВыписок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИсточникиЗагрузкиБанковскихВыписок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДиректБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисАУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтеграцияСБанком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/СверкаБанковскойВыписки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Результат.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	Результат.Вставить("ИспользоватьДанныеРасшифровки",      Истина);
	Результат.Вставить("ИспользоватьПриВыводеЗаголовка",     Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьПараметрыРасшифровкиОтчета(Адрес, Расшифровка, ПараметрыРасшифровки) Экспорт
	
	ДанныеОтчета = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ДанныеОтчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Заполнение соответствия полей, которые мы хотим получить из данных расшифровки
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("Период");
	СоответствиеПолей.Вставить("БанковскийСчет");
	СоответствиеПолей.Вставить("Организация");
	
	ДанныеРасшифровки = БухгалтерскиеОтчеты.ПолучитьДанныеРасшифровки(ДанныеОтчета.ДанныеРасшифровки, СоответствиеПолей, Расшифровка);
	Период = ДанныеРасшифровки.Получить("Период");
	БанковскийСчет = ДанныеРасшифровки.Получить("БанковскийСчет");
	Организация = ДанныеРасшифровки.Получить("Организация");
	
	Структура = Новый Структура;
	Структура.Вставить("Период", Период);
	Структура.Вставить("БанковскийСчет", БанковскийСчет);
	// Используется владелец счета вместо организации на случай,
	// если в пользовательских настройках группировки не окажется организации
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		Структура.Вставить("ВладелецСчета", БанковскийСчет.Владелец);
	КонецЕсли;
	Структура.Вставить("Организация", Организация);
	
	Возврат Структура;
	
КонецФункции

Процедура ПриВыводеЗаголовка(ПараметрыОтчета, КомпоновщикНастроек, Результат) Экспорт
	
	Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьОписаниеНастроек	= Макет.ПолучитьОбласть("ОписаниеНастроек");
	ОбластьОрганизация		= Макет.ПолучитьОбласть("Организация");
	
	//Организация
	ТекстОрганизация = БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(ПараметрыОтчета.Организация, 
		ПараметрыОтчета.ВключатьОбособленныеПодразделения, ПараметрыОтчета.КонецПериода);
	ОбластьОрганизация.Параметры.НазваниеОрганизации = ТекстОрганизация;
	Результат.Вывести(ОбластьОрганизация);
	
	//Заголовок
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = "" + ПолучитьТекстЗаголовка(ПараметрыОтчета);
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Область("R1:R" + Результат.ВысотаТаблицы).Имя = "Заголовок";
	
	//Показатели отчета
	Если ПараметрыОтчета.ПоказательТолькоДниРасхождений Тогда
		ТекстВыводимыеДанные = НСтр("ru = 'Только дни расхождений'");
		ОбластьОписаниеНастроек.Параметры.ИмяНастроекОтчета      = НСтр("ru = 'Выводимые данные:'");
		ОбластьОписаниеНастроек.Параметры.ОписаниеНастроекОтчета = ТекстВыводимыеДанные;
		Результат.Вывести(ОбластьОписаниеНастроек);
	КонецЕсли;
	
	// Единица измерения
	Если ПараметрыОтчета.Свойство("ВыводитьЕдиницуИзмерения")
		И ПараметрыОтчета.ВыводитьЕдиницуИзмерения Тогда
		ОбластьОписаниеЕдиницыИзмерения = Макет.ПолучитьОбласть("ОписаниеЕдиницыИзмерения");
		Результат.Вывести(ОбластьОписаниеЕдиницыИзмерения);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт
	
	ПредставлениеПериода = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
	ТекстЗаголовка = НСтр("ru='Сверка банковской выписки %1'");
	ШаблонЗаголовка = СтрШаблон(ТекстЗаголовка, ПредставлениеПериода);
	
	Возврат ШаблонЗаголовка;
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Таблица = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	Иначе
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоМесяца(ТекущаяДатаСеанса));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Иначе
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ТекущаяДатаСеанса));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.БанковскийСчет) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "БанковскийСчет", ПараметрыОтчета.БанковскийСчет);
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
	СчетаУчетаСредствВБанках = УчетДенежныхСредствПовтИсп.ПолучитьСчетаССубконтоБанковскиеСчета();
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Счет", СчетаУчетаСредствВБанках);
	
	// Показатели
	Если ПараметрыОтчета.ПоказательТолькоДниРасхождений Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "Расхождение", Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	// Добавление строк и колонок в отчет
	ГоризонтальнаяГруппировка = Таблица.Строки;
	ВертикальнаяГруппировка = Таблица.Колонки;
	Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл
		Если ПолеВыбраннойГруппировки.Использование Тогда
			Группировка = ГоризонтальнаяГруппировка.Добавить();
			ГоризонтальнаяГруппировка = Группировка.Структура;
			БухгалтерскиеОтчетыВызовСервера.ЗаполнитьГруппировку(ПолеВыбраннойГруппировки, Группировка);
		КонецЕсли;
	КонецЦикла;
	
	Группировка = ВертикальнаяГруппировка.Добавить();
	Группировка.Имя = "Шапка";
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметрВывода(Группировка, "РасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
	ДобавитьРесурсыОтчета(Группировка);
	
	ЕстьБанковскиеСчетаБезДанныхОбОстатках = ЕстьБанковскиеСчетаБезДанныхОбОстатках(ПараметрыОтчета.Организация,
		ПараметрыОтчета.БанковскийСчет, ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
	Если ЕстьБанковскиеСчетаБезДанныхОбОстатках Тогда
		ТаблицаПодвала = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
		ВертикальнаяГруппировка = ТаблицаПодвала.Колонки;
		Подвал = ВертикальнаяГруппировка.Добавить();
		Подвал.Имя = "Подвал";
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметрВывода(Подвал, "РасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
		ГруппаПодвал = Подвал.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаПодвал.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПодвал, "Подвал");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
	// Определим количество группировок.
	КоличествоГруппировок = 0;
	
	Для Каждого СтрокаТаблицы Из ПараметрыОтчета.Группировка Цикл
		Если СтрокаТаблицы.Использование Тогда
			КоличествоГруппировок = КоличествоГруппировок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоГруппировок <= 3 Тогда
		КоличествоГруппировок = 4;
	КонецЕсли;
	
	КоличествоСтрокПараметров = 0;
	БухгалтерскиеОтчетыПереопределяемый.ВысотаВыводимыхПараметров(ПараметрыОтчета.СхемаКомпоновкиДанных, КоличествоСтрокПараметров);
	Если ПараметрыОтчета.ПоказательТолькоДниРасхождений Тогда
		КоличествоГруппировок = КоличествоГруппировок + 2;
	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("ВыводитьЕдиницуИзмерения")
		И ПараметрыОтчета.ВыводитьЕдиницуИзмерения Тогда
		КоличествоГруппировок = КоличествоГруппировок + 2;
	КонецЕсли;
	
	ПараметрыОтчета.Вставить("ВысотаШапки", КоличествоСтрокПараметров + КоличествоГруппировок);

	Если Результат.Области.Найти("Заголовок") = Неопределено Тогда
		Если ПараметрыОтчета.ПоказательТолькоДниРасхождений Тогда
			ПараметрыОтчета.ВысотаШапки = ПараметрыОтчета.ВысотаШапки - 2;
		КонецЕсли;
		Если ПараметрыОтчета.ВыводитьЕдиницуИзмерения Тогда
			ПараметрыОтчета.ВысотаШапки = ПараметрыОтчета.ВысотаШапки - 2;
		КонецЕсли;
		Результат.ФиксацияСверху = ПараметрыОтчета.ВысотаШапки;
	Иначе
		Результат.ФиксацияСверху = Результат.Области.Заголовок.Низ + ПараметрыОтчета.ВысотаШапки;
	КонецЕсли;
	
	Результат.ФиксацияСлева = 0;
	
КонецПроцедуры

Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("ТолькоДниРасхождений");
	
	Возврат НаборПоказателей;
	
КонецФункции

Процедура ДобавитьРесурсыОтчета(Элемент)
	
	НаборПоказателей = НаборПоказателей();
	СуммыНачальныйОстаток = СуммыНачальныйОстаток();
	СуммыПоступление = СуммыПоступление();
	СуммыСписание = СуммыСписание();
	СуммыКонечныйОстаток = СуммыКонечныйОстаток();
	
	ГруппаПоказатели = Элемент.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаПоказатели.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаПоказатели.Заголовок = "Показатели";
	
	ГруппаНачальныйОстаток = Элемент.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаНачальныйОстаток.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаНачальныйОстаток.Заголовок = "НачальныйОстаток";

	ГруппаПоступление = Элемент.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаПоступление.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаПоступление.Заголовок = "Поступление";
	
	ГруппаСписание = Элемент.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаСписание.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаСписание.Заголовок = "Списание";
	
	ГруппаКонечныйОстаток = Элемент.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаКонечныйОстаток.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаКонечныйОстаток.Заголовок = "КонечныйОстаток";
		
	Для Каждого ИмяПоказателя Из НаборПоказателей Цикл
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПоказатели, "" + ИмяПоказателя);
		
	КонецЦикла;
	
	Для Каждого ИмяПоказателя Из СуммыНачальныйОстаток Цикл
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаНачальныйОстаток, "" + ИмяПоказателя);
		
	КонецЦикла;
	
	Для Каждого ИмяПоказателя Из СуммыПоступление Цикл
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПоступление, "" + ИмяПоказателя);
		
	КонецЦикла;
	
	Для Каждого ИмяПоказателя Из СуммыСписание Цикл
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСписание, "" + ИмяПоказателя);
		
	КонецЦикла;
	
	Для Каждого ИмяПоказателя Из СуммыКонечныйОстаток Цикл
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ГруппаКонечныйОстаток, "" + ИмяПоказателя);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаборПоказателей()
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("ПоказательПоДаннымУчета");
	НаборПоказателей.Добавить("ПоказательПоДаннымБанка");
	НаборПоказателей.Добавить("ПоказательРасхождение");
	
	Возврат НаборПоказателей;
КонецФункции 

Функция СуммыНачальныйОстаток()
	
	СуммыНачальныйОстаток = Новый Массив;
	СуммыНачальныйОстаток.Добавить("НачальныйОстаток.НачальныйОстатокПоДаннымУчета");
	СуммыНачальныйОстаток.Добавить("НачальныйОстаток.НачальныйОстатокПоДаннымБанка");
	СуммыНачальныйОстаток.Добавить("НачальныйОстаток.РасхождениеНачальногоОстатка");
	
	Возврат СуммыНачальныйОстаток;
КонецФункции 

Функция СуммыКонечныйОстаток()
	
	СуммыКонечныйОстаток = Новый Массив;
	СуммыКонечныйОстаток.Добавить("КонечныйОстаток.КонечныйОстатокПоДаннымУчета");
	СуммыКонечныйОстаток.Добавить("КонечныйОстаток.КонечныйОстатокПоДаннымБанка");
	СуммыКонечныйОстаток.Добавить("КонечныйОстаток.РасхождениеКонечногоОстатка");
	
	Возврат СуммыКонечныйОстаток;
КонецФункции

Функция СуммыПоступление()
	
	СуммыПоступление = Новый Массив;
	СуммыПоступление.Добавить("Поступление.ПоступлениеПоДаннымУчета");
	СуммыПоступление.Добавить("Поступление.ПоступлениеПоДаннымБанка");
	СуммыПоступление.Добавить("Поступление.РасхождениеПоступления");
	
	Возврат СуммыПоступление;
КонецФункции

Функция СуммыСписание()
	
	СуммыСписание = Новый Массив;
	СуммыСписание.Добавить("Списание.СписаниеПоДаннымУчета");
	СуммыСписание.Добавить("Списание.СписаниеПоДаннымБанка");
	СуммыСписание.Добавить("Списание.РасхождениеСписания");
	
	Возврат СуммыСписание;
КонецФункции

Функция ЕстьБанковскиеСчетаБезДанныхОбОстатках(Организация, БанковскийСчет, НачалоПериода, КонецПериода)
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗагруженныеБанковскиеВыписки.БанковскийСчет КАК БанковскийСчет
		|ИЗ
		|	РегистрСведений.ЗагруженныеБанковскиеВыписки КАК ЗагруженныеБанковскиеВыписки
		|ГДЕ
		|	ЗагруженныеБанковскиеВыписки.БанковскийСчет = &БанковскийСчет
		|	И ЗагруженныеБанковскиеВыписки.Организация = &Организация
		|	И ЗагруженныеБанковскиеВыписки.ИсточникЗагрузки = ЗНАЧЕНИЕ(Перечисление.ИсточникиЗагрузкиБанковскихВыписок.СервисАУСН)
		|	И ЗагруженныеБанковскиеВыписки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗагруженныеБанковскиеВыписки.ДанныеОбОстаткахОтсутствуют";
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаСеанса));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Иначе
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДатаСеанса));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Иначе
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, "ЗагруженныеБанковскиеВыписки.БанковскийСчет = &БанковскийСчет", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, "ЗагруженныеБанковскиеВыписки.Организация = &Организация",
			"ЗагруженныеБанковскиеВыписки.Организация В (&Организация)");
		Запрос.УстановитьПараметр("Организация", ДоступныеОрганизации);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти

#КонецЕсли
